In [2]:
#read file df1.csv
import pandas as pd
df1=pd.read_csv("C:\\Users\\prasanna\\df1.csv")

In [4]:
#print 2nd to 5th row
df1[2:6]

       RollNo       Name  Age Gender  Country     Course
2  mit23f1010      Kerin   26      M    Italy    Biology
3  mit23f1011  Alexander   23      M  Germany  Chemistry
4  mit23f1012       Anna   25      F      USA    Biology
5  mit23f1013  Katherine   24      F      USA  Chemistry

In [5]:
#print 3rd column
df1.columns[3]

'Gender'

In [4]:
#print last two rows
df1.tail(2)

        RollNo   Name  Age Gender Country Course
12  mit23f1020  Asahi   26      M   China   Math
13  mit23f1021   Sara   25      F   Japan   Math

In [7]:
#get all rows where country name = India
df2=df1.loc[df1['Country']=='India']

In [6]:
#get unique country name
df1["Country"].unique

<bound method Series.unique of 0         USA
1      France
2       Italy
3     Germany
4         USA
5         USA
6      France
7         USA
8       Italy
9         USA
10      India
11      India
12      China
13      Japan
Name: Country, dtype: object>

In [7]:
#avg age of indian students
df1[df1['Country']=='India'].Age.mean()

24.5

In [8]:
#create new column by name+country
df1["country_name"] = df1["Name"] + df1["Country"]
df1.head()

       RollNo       Name  Age Gender  Country     Course      country_name
0  mit23f1008       Paul   25      M      USA    Biology           PaulUSA
1  mit23f1009      Roger   24      M   France    Physics       RogerFrance
2  mit23f1010      Kerin   26      M    Italy    Biology        KerinItaly
3  mit23f1011  Alexander   23      M  Germany  Chemistry  AlexanderGermany
4  mit23f1012       Anna   25      F      USA    Biology           AnnaUSA

In [9]:
#group by avg age for course
df1.groupby('Course').Age.mean()

Course
Biology      25.333333
Chemistry    24.500000
Math         25.000000
Physics      25.000000
Name: Age, dtype: float64

In [10]:
#group by avg age for gender
df1.groupby('Gender').Age.mean()

Gender
F    24.600000
M    25.111111
Name: Age, dtype: float64

In [11]:
#sort df1 by age
df1.sort_values(by='Age')

        RollNo       Name  Age Gender  Country     Course      country_name
3   mit23f1011  Alexander   23      M  Germany  Chemistry  AlexanderGermany
1   mit23f1009      Roger   24      M   France    Physics       RogerFrance
5   mit23f1013  Katherine   24      F      USA  Chemistry      KatherineUSA
10  mit23f1018   Aadwaita   24      F    India       Math     AadwaitaIndia
0   mit23f1008       Paul   25      M      USA    Biology           PaulUSA
4   mit23f1012       Anna   25      F      USA    Biology           AnnaUSA
6   mit23f1014     Michel   25      F   France  Chemistry      MichelFrance
9   mit23f1017       Evan   25      M      USA    Physics           EvanUSA
11  mit23f1019  Bharathan   25      M    India    Physics    BharathanIndia
13  mit23f1021       Sara   25      F    Japan       Math         SaraJapan
2   mit23f1010      Kerin   26      M    Italy    Biology        KerinItaly
7   mit23f1015        Nic   26      M      USA  Chemistry            NicUSA
8   mit23f1016      James   26      M    Italy    Physics        JamesItaly
12  mit23f1020      Asahi   26      M    China       Math        AsahiChina

In [12]:
#read both df1 and df2
df1=pd.read_csv("C:\\Users\\prasanna\\df1.csv")
df2=pd.read_csv("C:\\Users\\prasanna\\df2.csv")

In [16]:
#get all those rows commom in both data sets
df4=pd.merge(df1,df2,on = 'RollNo' , how='inner')
df4

,RollNo,Name_x,Age_x,Gender_x,Country_x,Course_x,Name_y,Age_y,Gender_y,Country_y,Course_y
0,mit23f1010,Kerin,26,M,Italy,Biology,Kerin,26,M,Italy,Biology
1,mit23f1011,Alexander,23,M,Germany,Chemistry,Alexander,23,M,Germany,Chemistry
2,mit23f1013,Katherine,24,F,USA,Chemistry,Katherine,24,F,USA,Chemistry
3,mit23f1019,Bharathan,25,M,India,Physics,Bharathan,25,M,India,Physics
4,mit23f1021,Sara,25,F,Japan,Math,Sara,25,F,Japan,Math

In [14]:
#concatenate by rows of both data sets
df3=pd.concat([df1,df2],axis = 0)
df3.shape

(28, 6)

In [15]:
#get the average age of students by country from the concatenated dataset
df3.groupby('Country').Age.mean()

Country
China      26.000000
France     25.000000
Germany    23.333333
India      24.500000
Italy      26.000000
Japan      24.666667
UK         24.666667
USA        25.125000
Name: Age, dtype: float64